In [6]:
import pandas as pd
orders=pd.DataFrame({'OrderID':[1,2,3,4,5],'CustomerID':[101,102,103,104,101],'Product':['A','B','A','C','B']})

In [8]:
orders

   OrderID  CustomerID Product
0        1         101       A
1        2         102       B
2        3         103       A
3        4         104       C
4        5         101       B

In [10]:
customers=pd.DataFrame({'CustomerID':[101,102,103,104],'Name':['Alice','Bob','Charlie','David'],'Location':['NewYork','LosAngeles','Chicago','Houston']})
customers

   CustomerID     Name    Location
0         101    Alice     NewYork
1         102      Bob  LosAngeles
2         103  Charlie     Chicago
3         104    David     Houston

In [12]:
merged_data=pd.merge(orders,customers,on='CustomerID')
merged_data

   OrderID  CustomerID Product     Name    Location
0        1         101       A    Alice     NewYork
1        2         102       B      Bob  LosAngeles
2        3         103       A  Charlie     Chicago
3        4         104       C    David     Houston
4        5         101       B    Alice     NewYork

In [18]:
merged_data.groupby('Location')['OrderID'].count()

Location
Chicago       1
Houston       1
LosAngeles    1
NewYork       2
Name: OrderID, dtype: int64